RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/components/serialization/application/codecs/ble/middleware/app_mw_ble_gap.c
#ifndef _sd_ble_gap_whitelist_set
#define _sd_ble_gap_whitelist_set sd_ble_gap_whitelist_set
#endif
uint32_t _sd_ble_gap_whitelist_set(ble_gap_addr_t const * const * pp_wl_addrs, uint8_t len)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);

    const uint32_t err_code = ble_gap_whitelist_set_req_enc(pp_wl_addrs, len,
                                                            &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_whitelist_set_rsp_dec);
}

/**@brief Command response callback function for @ref sd_ble_gap_device_identities_set BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_device_identities_set_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    const uint32_t err_code = ble_gap_device_identities_set_rsp_dec(p_buffer,
                                                                    length,
                                                                    &result_code);

    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);
    return result_code;
}

#ifndef _sd_ble_gap_device_identities_set
#define _sd_ble_gap_device_identities_set sd_ble_gap_device_identities_set
#endif
uint32_t _sd_ble_gap_device_identities_set(ble_gap_id_key_t const * const * pp_id_keys, ble_gap_irk_t const * const * pp_local_irks, uint8_t len)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);

    const uint32_t err_code = ble_gap_device_identities_set_req_enc(pp_id_keys,
                                                                    pp_local_irks,
                                                                    len,
                                                                    &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_device_identities_set_rsp_dec);
}

#if NRF_SD_BLE_API_VERSION >= 4 && !defined(S112)
/**@brief Command response callback function for @ref sd_ble_gap_data_length_update BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_data_length_update_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    const uint32_t err_code = ble_gap_data_length_update_rsp_dec(p_buffer,
                                                          length,
                                                          (ble_gap_data_length_limitation_t *)mp_out_params[0],
                                                          &result_code);

    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);
    return result_code;
}

#ifndef _sd_ble_gap_data_length_update
#define _sd_ble_gap_data_length_update sd_ble_gap_data_length_update
#endif
uint32_t _sd_ble_gap_data_length_update(uint16_t conn_handle,
                                       ble_gap_data_length_params_t const *p_dl_params,
                                       ble_gap_data_length_limitation_t *p_dl_limitation)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;
    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);
    mp_out_params[0] = p_dl_limitation;

    const uint32_t err_code = ble_gap_data_length_update_req_enc(conn_handle, p_dl_params,p_dl_limitation,
                                                          &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                     (++buffer_length),
                                     gap_data_length_update_rsp_dec);
}

#endif // NRF_SD_BLE_API_VERSION >= 4 && !defined(S112)

#if NRF_SD_BLE_API_VERSION >= 5
/**@brief Command response callback function for @ref sd_ble_gap_phy_update BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_phy_update_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    const uint32_t err_code = ble_gap_phy_update_rsp_dec(p_buffer,
                                                          length,
                                                          &result_code);

    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);



    return result_code;
}

#ifndef _sd_ble_gap_phy_update
#define _sd_ble_gap_phy_update sd_ble_gap_phy_update
#endif
uint32_t _sd_ble_gap_phy_update(uint16_t                     conn_handle,
                                 ble_gap_phys_t const * const p_gap_phys)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);
    const uint32_t err_code = ble_gap_phy_update_req_enc(conn_handle, p_gap_phys,
                                                           &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_phy_update_rsp_dec);
}
#endif

#if NRF_SD_BLE_API_VERSION >= 6
/**@brief Command response callback function for @ref sd_ble_gap_adv_set_configure BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_adv_set_configure_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    uint32_t err_code = ble_gap_adv_set_configure_rsp_dec(p_buffer,
                                                          length,
                                                          (uint8_t *)mp_out_params[0],
                                                          &result_code);

    if (result_code != NRF_SUCCESS)
    {
    	app_ble_gap_adv_buf_addr_unregister(mp_out_params[0], false);
    	app_ble_gap_adv_buf_addr_unregister(mp_out_params[1], false);
    }

    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    APP_ERROR_CHECK(err_code);

    return result_code;
}

#ifndef _sd_ble_gap_adv_set_configure
#define _sd_ble_gap_adv_set_configure sd_ble_gap_adv_set_configure
#endif
uint32_t _sd_ble_gap_adv_set_configure(uint8_t *p_adv_handle,
                                       ble_gap_adv_data_t const *p_adv_data,
                                       ble_gap_adv_params_t const *p_adv_params)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);

