RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/components/serialization/application/codecs/ble/middleware/app_mw_ble_gap.c
    if (p_adv_handle)
    {
        mp_out_params[0] = p_adv_data->adv_data.p_data;
        mp_out_params[1] = p_adv_data->scan_rsp_data.p_data;
    }
    else
    {
        mp_out_params[0] =  NULL;
        mp_out_params[1] =  NULL;
    }

    const uint32_t err_code = ble_gap_adv_set_configure_req_enc(p_adv_handle, p_adv_data, p_adv_params,
                                                                &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_adv_set_configure_rsp_dec);
}

#ifndef S112
/**@brief Command response callback function for @ref sd_ble_gap_qos_channel_survey_start BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_qos_channel_survey_start_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    uint32_t err_code = ble_gap_qos_channel_survey_start_rsp_dec(p_buffer,
                                                                 length,
                                                                 &result_code);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    return result_code;
}

#ifndef _sd_ble_gap_qos_channel_survey_start
#define _sd_ble_gap_qos_channel_survey_start sd_ble_gap_qos_channel_survey_start
#endif
uint32_t _sd_ble_gap_qos_channel_survey_start(uint32_t interval_us)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);

    const uint32_t err_code = ble_gap_qos_channel_survey_start_req_enc(interval_us,
                                                                       &(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_qos_channel_survey_start_rsp_dec);
}

/**@brief Command response callback function for @ref sd_ble_gap_qos_channel_survey_stop BLE command.
 *
 * Callback for decoding the output parameters and the command response return code.
 *
 * @param[in] p_buffer  Pointer to begin of command response buffer.
 * @param[in] length    Length of data in bytes.
 *
 * @return Decoded command response return code.
 */
static uint32_t gap_qos_channel_survey_stop_rsp_dec(const uint8_t * p_buffer, uint16_t length)
{
    uint32_t result_code = 0;

    uint32_t err_code = ble_gap_qos_channel_survey_stop_rsp_dec(p_buffer,
                                                                 length,
                                                                 &result_code);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    return result_code;
}

#ifndef _sd_ble_gap_qos_channel_survey_stop
#define _sd_ble_gap_qos_channel_survey_stop sd_ble_gap_qos_channel_survey_stop
#endif
uint32_t _sd_ble_gap_qos_channel_survey_stop(void)
{
    uint8_t * p_buffer;
    uint32_t  buffer_length = 0;

    tx_buf_alloc(&p_buffer, (uint16_t *)&buffer_length);

    const uint32_t err_code = ble_gap_qos_channel_survey_stop_req_enc(&(p_buffer[1]), &buffer_length);
    //@note: Should never fail.
    APP_ERROR_CHECK(err_code);

    //@note: Increment buffer length as internally managed packet type field must be included.
    return ser_sd_transport_cmd_write(p_buffer,
                                      (++buffer_length),
                                      gap_qos_channel_survey_stop_rsp_dec);
}
#endif //!S112
#endif
